# Homebrew Bundle File
# Install all packages with: brew bundle

# ========================================
# Taps
# ========================================
tap "atlassian/acli"               # Atlassian CLI tools
tap "felixkratz/formulae"          # Sketchybar and Borders
tap "m-mohamed/rehoboam"           # Rehoboam
tap "mhaeuser/mhaeuser"            # Custom formulae
tap "nikitabobko/tap"              # AeroSpace window manager
tap "oven-sh/bun"                  # Bun JavaScript runtime
tap "supabase/tap"                 # Supabase CLI

# ========================================
# CLI Tools - Core Utilities
# ========================================
brew "git"                         # Version control
brew "make"                        # Build automation
brew "ripgrep"                     # Fast grep alternative
brew "fd"                          # Fast find alternative
brew "jq"                          # JSON processor
brew "fswatch"                     # File change monitor

# ========================================
# CLI Tools - Development
# ========================================
brew "neovim", args: ["HEAD"]      # Text editor
brew "lua"                         # Neovim scripting language
brew "python@3.14"                 # Python 3.14
brew "node"                        # JavaScript runtime
brew "rust"                        # Rust programming language
brew "vite"                        # Frontend build tool
brew "mysql"                       # Database

# ========================================
# CLI Tools - Productivity
# ========================================
brew "fzf"                         # Fuzzy finder
brew "gum"                         # Terminal UI components
brew "gh"                          # GitHub CLI
brew "lazygit"                     # Terminal UI for git
brew "tmux"                        # Terminal multiplexer
brew "neofetch"                    # System info display
brew "starship"                    # Shell prompt
brew "zoxide"                      # Smarter cd command
brew "zsh-autosuggestions"         # Fish-like autosuggestions for zsh
brew "nowplaying-cli"              # Now playing info
brew "switchaudio-osx"             # Audio device switcher
brew "fish"                        # Alternative shell
brew "awscli"                      # AWS CLI
brew "tailscale"                   # VPN mesh network

# ========================================
# CLI Tools - Custom Taps
# ========================================
brew "atlassian/acli/acli"         # Atlassian command line
brew "felixkratz/formulae/borders" # Window borders
brew "felixkratz/formulae/sketchybar"  # Status bar
brew "m-mohamed/rehoboam/rehoboam" # Rehoboam
brew "oven-sh/bun/bun"             # Bun JavaScript runtime
brew "supabase/tap/supabase"       # Supabase tools

# ========================================
# Applications - Development
# ========================================
cask "cursor"                      # AI-powered code editor
cask "visual-studio-code"          # Code editor
cask "ghostty"                     # Terminal emulator

# ========================================
# Applications - Productivity
# ========================================
cask "aerospace"                   # Window manager
cask "alt-tab"                     # Windows-style alt-tab
cask "raycast"                     # Launcher (not in Brewfile but mentioned in your setup)
cask "shottr"                      # Screenshot tool
cask "hiddenbar"                   # Menu bar manager
cask "appcleaner"                  # Uninstaller

# ========================================
# Applications - Media
# ========================================
cask "aerial"                      # Screensaver
cask "stremio"                     # Streaming app
cask "screen-studio"               # Screen recording

# ========================================
# Applications - Communication
# ========================================
cask "zoom"                        # Video conferencing
cask "parsec"                      # Remote desktop

# ========================================
# Applications - Office
# ========================================
cask "microsoft-office"            # Office suite
cask "microsoft-auto-update"       # Office auto-updater

# ========================================
# Fonts
# ========================================
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with icons
cask "font-sf-mono"                # SF Mono (Apple font)
cask "font-sf-pro"                 # SF Pro (Apple font)

# ========================================
# Developer Tools
# ========================================
cask "basictex"                    # Minimal TeX distribution
cask "sf-symbols"                  # Apple SF Symbols app
cask "battery-toolkit"             # Battery management

# ========================================
# VS Code Extensions
# ========================================
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "imzivko.cursor-dark-core"
vscode "james-yu.latex-workshop"
vscode "leetnotion.vscode-leetnotion"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mohd-akram.vscode-html-format"
vscode "mongodb.mongodb-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "oderwat.indent-rainbow"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
